Stable_Initialisation/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

solver          shockFluid;

startFrom       latestTime;
startTime       8.338e-5;

stopAt          endTime;
endTime         0.02;

deltaT          1e-9;
adjustTimeStep  yes;
maxCo           0.3;
maxDeltaT       1e-4;

writeControl    timeStep;
writeInterval   10000;

purgeWrite      6;
writeFormat     ascii;
writePrecision  8;
writeCompression off;

timeFormat      general;
timePrecision   6;

functions
{
    writeKeyFields
    {
        type            writeObjects;
        libs            ("libutilityFunctionObjects.so");
        writeControl    writeTime;
        writeOption     anyWrite;
        objects         (p rho T k omega U);
    }
}

runTimeModifiable true;
