Stable_Initialisation/constant/thermophysicalProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}

thermoType
{
    type            hePsiThermo;
    mixture         pureMixture;
    transport       sutherland;
    thermo          eConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        nMoles      1;
        molWeight   28.96;
    }
    thermodynamics
    {
        Cv          718;
        Hf          0;
    }
    transport
    {
        As          1.458e-06;
        Ts          110.4;
    }
}
