Stable_Initialisation/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar> 
111248
(
350
350
350
350
350
350
350
350
...
)
;

boundaryField
{
    FRONT
    {
        type            empty;
    }
    INLET
    {
        type            fixedValue;
        value           uniform 300;
    }
    SOLID_WALL
    {
        type            zeroGradient;
    }
    AXIALSYMMETRY
    {
        type            symmetryPlane;
    }
    BACK
    {
        type            empty;
    }
    FARFIELD
    {
        type            fixedValue;
        value           uniform 300;
    }
    OUTLET
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
