Stable_Initialisation/0/alphat
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    FRONT
    {
        type            empty;
    }
    INLET
    {
        type            zeroGradient;
    }
    SOLID_WALL
    {
        type            compressible::alphatWallFunction;
        nut             nut;
        value           uniform 0;
    }
    AXIALSYMMETRY
    {
        type            symmetryPlane;
    }
    BACK
    {
        type            empty;
    }
    FARFIELD
    {
        type            zeroGradient;
    }
    OUTLET
    {
        type            zeroGradient;
    }
}
