Stable_Initialisation/0/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    FRONT
    {
        type            empty;
    }
    INLET
    {
        type            calculated;
        value           uniform 0;
    }
    SOLID_WALL
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    AXIALSYMMETRY
    {
        type            symmetryPlane;
    }
    BACK
    {
        type            empty;
    }
    FARFIELD
    {
        type            calculated;
        value           uniform 0;
    }
    OUTLET
    {
        type            calculated;
        value           uniform 0;
    }
}
