Stable_Initialisation/0/omega
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    FRONT
    {
        type            empty;
    }
    INLET
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
    SOLID_WALL
    {
        type            omegaWallFunction;
        value           uniform 1;
    }
    AXIALSYMMETRY
    {
        type            symmetryPlane;
    }
    BACK
    {
        type            empty;
    }
    FARFIELD
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
    OUTLET
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
}
