Stable_Initialisation/system/setFieldsDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}

default
(
    volScalarFieldValue p 101325
    volScalarFieldValue T 300
    volVectorFieldValue U (0 0 0)
);

regions
(
    zoneToCell
    {
        zone INIT_ZONE;
        fieldValues
        (
            volScalarFieldValue p 5e6
            volVectorFieldValue U (150 0 0)
            volScalarFieldValue T 350
        );
    }
);
